
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |        2 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                  |
|:--------:|:---------------------------------------------------------------------------|
|    🟢    | `module.openvpn-oauth-client-id.aws_secretsmanager_secret.secret`          |
|    🟢    | `module.openvpn-oauth-client-id.aws_secretsmanager_secret_version.current` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.openvpn-oauth-client-id.data.external.secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/openvpn-oauth-client-id/assets/get_secret.py",
          + "us-west-1",
          + (known after apply),
          + "arn:aws:iam::303467602807:role/ih-tf-github-control-admin",
        ]
      + result  = (known after apply)
    }

  # module.openvpn-oauth-client-id.aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + description                    = "Get OAuth 2.0 Client IDs from https://console.cloud.google.com/auth/clients - the secret is used for CI tests in terraform-aws-openvpn"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "openvpn-client-id-"
      + policy                         = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "*"
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/ih-tf-github-control-admin"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:UpdateSecretVersionStage",
                          + "secretsmanager:UpdateSecret",
                          + "secretsmanager:RotateSecret",
                          + "secretsmanager:RestoreSecret",
                          + "secretsmanager:PutSecretValue",
                          + "secretsmanager:ListSecrets",
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:GetRandomPassword",
                          + "secretsmanager:DescribeSecret",
                          + "secretsmanager:CancelRotateSecret",
                          + "secretsmanager:BatchGetSecretValue",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_422821c726d81c14"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:ValidateResourcePolicy",
                          + "secretsmanager:UntagResource",
                          + "secretsmanager:TagResource",
                          + "secretsmanager:StopReplicationToReplica",
                          + "secretsmanager:ReplicateSecretToRegions",
                          + "secretsmanager:RemoveRegionsFromReplication",
                          + "secretsmanager:PutResourcePolicy",
                          + "secretsmanager:DeleteSecret",
                          + "secretsmanager:DeleteResourcePolicy",
                          + "secretsmanager:CreateSecret",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_422821c726d81c14"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:GetRandomPassword",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/openvpn-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:ValidateResourcePolicy",
                          + "secretsmanager:UpdateSecretVersionStage",
                          + "secretsmanager:UpdateSecret",
                          + "secretsmanager:UntagResource",
                          + "secretsmanager:TagResource",
                          + "secretsmanager:StopReplicationToReplica",
                          + "secretsmanager:RotateSecret",
                          + "secretsmanager:RestoreSecret",
                          + "secretsmanager:ReplicateSecretToRegions",
                          + "secretsmanager:RemoveRegionsFromReplication",
                          + "secretsmanager:PutSecretValue",
                          + "secretsmanager:PutResourcePolicy",
                          + "secretsmanager:ListSecrets",
                          + "secretsmanager:DeleteSecret",
                          + "secretsmanager:DeleteResourcePolicy",
                          + "secretsmanager:CreateSecret",
                          + "secretsmanager:CancelRotateSecret",
                          + "secretsmanager:BatchGetSecretValue",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/openvpn-tester"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:ListSecrets",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:role/aws-service-role/access-analyzer.amazonaws.com/AWSServiceRoleForAccessAnalyzer"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:ValidateResourcePolicy",
                          + "secretsmanager:UpdateSecretVersionStage",
                          + "secretsmanager:UpdateSecret",
                          + "secretsmanager:UntagResource",
                          + "secretsmanager:TagResource",
                          + "secretsmanager:StopReplicationToReplica",
                          + "secretsmanager:RotateSecret",
                          + "secretsmanager:RestoreSecret",
                          + "secretsmanager:ReplicateSecretToRegions",
                          + "secretsmanager:RemoveRegionsFromReplication",
                          + "secretsmanager:PutSecretValue",
                          + "secretsmanager:PutResourcePolicy",
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetRandomPassword",
                          + "secretsmanager:DeleteSecret",
                          + "secretsmanager:DeleteResourcePolicy",
                          + "secretsmanager:CreateSecret",
                          + "secretsmanager:CancelRotateSecret",
                          + "secretsmanager:BatchGetSecretValue",
                        ]
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:role/aws-service-role/access-analyzer.amazonaws.com/AWSServiceRoleForAccessAnalyzer"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "*"
                      + Condition = {
                          + ArnNotLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::303467602807:role/ih-tf-github-control-admin",
                                  + "arn:aws:iam::303467602807:role/aws-service-role/access-analyzer.amazonaws.com/AWSServiceRoleForAccessAnalyzer",
                                  + "arn:aws:iam::303467602807:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_422821c726d81c14",
                                  + "arn:aws:iam::303467602807:role/openvpn-tester",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + recovery_window_in_days        = 0
      + tags                           = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/secret/aws"
          + "environment"       = "production"
          + "module_version"    = "1.1.0"
          + "owner"             = "arn:aws:iam::303467602807:role/ih-tf-github-control-admin"
          + "service"           = "unknown"
        }
      + tags_all                       = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse8/github-control"
          + "created_by_module" = "infrahouse/secret/aws"
          + "environment"       = "production"
          + "module_version"    = "1.1.0"
          + "owner"             = "arn:aws:iam::303467602807:role/ih-tf-github-control-admin"
          + "service"           = "unknown"
        }

      + replica (known after apply)
    }

  # module.openvpn-oauth-client-id.aws_secretsmanager_secret_version.current will be created
  + resource "aws_secretsmanager_secret_version" "current" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = [
          + "INITIAL",
        ]
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAiYWRkIjogMiwgImNoYW5nZSI6IDAsICJkZXN0cm95IjogMH19
```
</details>